In [2]:
import pandas as pd
# import numpy as np
df = pd.read_csv("marks.csv")
df

    RollNo    Name  Class     Game Gender  Marks
0    10001     abc     10  Cricket      M     99
1    10002   rahul     10   Hockey      F     88
2    10003   seema     11  Cricket      M     77
3    10004     anu     11  Cricket      M     99
4    10005    rita     12   Hockey      M     66
5    10006   manju     12    Chess      F     77
6    10007    tina     12  Cricket      F     87
7    10008    anil     10   Hockey      M     76
8    10009   rajan     11    Chess      F     34
9    10010  deepak     10    Chess      M     46
10   10011  manish     12   Hockey      F     58
11   10012    hina     12   Hockey      M     58
12   10013  rqtyui     10  Cricket      M     99
13   10014  sushil     10   Hockey      F     88
14   10015   rajat     11  Cricket      M     77
15   10016  rajeev     11  Cricket      M     99
16   10017    tina     12   Hockey      M     66
17   10018   ranju     12    Chess      F     77
18   10019    jini     12  Cricket      F     87
19   10020    kini     10   Hockey      M     76
20   10021   kamna     11    Chess      F     34
21   10022   ranju     10    Chess      M     46
22   10023    arti     12   Hockey      F     58
23   10024    mini     12   Hockey      M     58

In [5]:
df.dtypes

RollNo     int64
Name      object
Class      int64
Game      object
Gender    object
Marks      int64
dtype: object

In [6]:
gen=df.groupby('Game')

In [7]:
gen

In [8]:
gen['Marks'].agg(sum)

Game
Chess      314
Cricket    724
Hockey     692
Name: Marks, dtype: int64

In [9]:
type (gen)

pandas.core.groupby.generic.DataFrameGroupBy

In [10]:
gen.groups

{'Chess': [5, 8, 9, 17, 20, 21], 'Cricket': [0, 2, 3, 6, 12, 14, 15, 18], 'Hockey': [1, 4, 7, 10, 11, 13, 16, 19, 22, 23]}

In [13]:
classgame=df.groupby(["Game","Class"])
classgame.groups

{('Chess', 10): [9, 21], ('Chess', 11): [8, 20], ('Chess', 12): [5, 17], ('Cricket', 10): [0, 12], ('Cricket', 11): [2, 3, 14, 15], ('Cricket', 12): [6, 18], ('Hockey', 10): [1, 7, 13, 19], ('Hockey', 12): [4, 10, 11, 16, 22, 23]}